/*
 Для всех задач сделайте один проект, в котором все задачи будут сделаны на разных контроллерах:

Два текстовых поля для имени и фамилии, которые сохраняют введенные данные в UserDefaults, а при повторном запуске приложения показывают последнее введенные строки
 
 
 
Список Todo-задач, в который можно добавлять и удалять задачи, и задачи кэшируются в Realm, а при повторном запуске показываются последние сохраненные задачи
То же самое, только с использованием CoreData

Перенесите экран с показом погоды из предыдущего домашнего задания в этот проект. Сделайте кэширование для текущей погоды и прогноза после загрузки с сервера, чтобы после перезапуска показывалась последние сохраненные данные (пока идет повторное обновление).
Создайте аккаунт на http://bitbucket.org/ и http://github.com, в каждом из сервисов создайте публичный репозиторий под этот проект, выгрузите его в них и пришлите ссылки на эти репозитории.
*/
